app/controllers/movies_controller.rb

    end

    if @ratings and @sort_by
      @movies = Movie.where(rating:@ratings.keys).find(:all, :order=>(params[:sort_by]))
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('R') ORDER BY release_date

      @movies = Movie.where(rating:@ratings.keys)
    elsif @sort_by
      @ratings = Hash.new
      @movies = Movie.find(:all, order: params[:sort_by])
    else
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE 1=0
SELECT "movies".* FROM "movies" ORDER BY release_date